/**
 * @license
 * Copyright 2025 Google LLC
 * SPDX-License-Identifier: Apache-2.0
 */

export const shortAsciiLogo = `
 ▄▀▀▄ █▀▀▄ █▀▀▀ █▀▀▄  ▄▀▀▄ ▄▀▀▀ █▀▀▀ █▀▀▄ ▀█▀
 █  █ █▀▀  █▀▀  █  █  █▀▀█ █ ▀█ █▀▀  █  █  █
  ▀▀  ▀    ▀▀▀▀ ▀  ▀  ▀  ▀  ▀▀▀ ▀▀▀▀ ▀  ▀  ▀
`;

export const longAsciiLogo = `
 ▄▀▀▄ █▀▀▄ █▀▀▀ █▀▀▄  ▄▀▀▄ ▄▀▀▀ █▀▀▀ █▀▀▄ ▀█▀
 █  █ █▀▀  █▀▀  █  █  █▀▀█ █ ▀█ █▀▀  █  █  █
  ▀▀  ▀    ▀▀▀▀ ▀  ▀  ▀  ▀  ▀▀▀ ▀▀▀▀ ▀  ▀  ▀
`;

export const tinyAsciiLogo = `
 ▄▀▀▄  ▄▀▀▄
 █  █  █▀▀█
  ▀▀   ▀  ▀
`;

export const shortAsciiLogoCompactText = `
▄▀▀▄ █▀▀▄ █▀▀▀ █▀▀▄  ▄▀▀▄ ▄▀▀▀ █▀▀▀ █▀▀▄ ▀█▀
█  █ █▀▀  █▀▀  █  █  █▀▀█ █ ▀█ █▀▀  █  █  █
 ▀▀  ▀    ▀▀▀▀ ▀  ▀  ▀  ▀  ▀▀▀ ▀▀▀▀ ▀  ▀  ▀
`;

export const longAsciiLogoCompactText = `
▄▀▀▄ █▀▀▄ █▀▀▀ █▀▀▄  ▄▀▀▄ ▄▀▀▀ █▀▀▀ █▀▀▄ ▀█▀
█  █ █▀▀  █▀▀  █  █  █▀▀█ █ ▀█ █▀▀  █  █  █
 ▀▀  ▀    ▀▀▀▀ ▀  ▀  ▀  ▀  ▀▀▀ ▀▀▀▀ ▀  ▀  ▀
`;

export const tinyAsciiLogoCompactText = `
▄▀▀▄ ▄▀▀▄
█  █ █▀▀█
 ▀▀  ▀  ▀
`;
